 gcc -g p1final.c
 ./a.out
enter two numbers 
34
55
sum of 34 and 55 is 89
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x772: file p1final.c, line 3.
(gdb) r
Starting program: /home/runner/test4-Veeranaganjineyareddy-84/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:3
3   {
(gdb) n
5     printf("enter two numbers \n");
(gdb) n
enter two numbers 
6     scanf("%d %d", &a, &b);
(gdb) n
n
7     c=a+b;
(gdb) n
8     printf("sum of %d and %d is %d\n", a, b, c);
(gdb) n
sum of 22094 and 844174368 is 844196462
9     return 0;
(gdb) s
10  }(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 101) exited normally]
(gdb) l
5     printf("enter two numbers \n");
6     scanf("%d %d", &a, &b);
7     c=a+b;
8     printf("sum of %d and %d is %d\n", a, b, c);
9     return 0;
10  }(gdb) 