gcc -g p4final.c
 ./a.out
enter the value:3
enter the value:9
enter the value:10
among 3,9,10
10 is greatest 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x7f0: file p4final.c, line 33.
(gdb) r n
Starting program: /home/runner/test4-Veeranaganjineyareddy-37/a.out n
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p4final.c:33
33    r=input();
(gdb) n
enter the value:n
34    t=input();
(gdb) n
35    p=input();
(gdb) n
36    s=cmp(r,t,p);
(gdb) n
37    output(r,t,p,s);
(gdb) n
enter the value:enter the value:among 32572,32572,32572
38    return 0;
(gdb) s
39  }
(gdb) p
The history is empty.
(gdb) c
Continuing.
32572 is greatest[Inferior 1 (process 76) exited normally]
(gdb) l
34    t=input();
35    p=input();
36    s=cmp(r,t,p);
37    output(r,t,p,s);
38    return 0;
39  }
(gdb) 
