gcc -g p4original.c
 ./a.out
enter the value:9
enter the value:0
enter the value:8
among 9,0,8
9 is greatest 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
 
 gcc -g p4original.c
 ./a.out
enter the value:9
enter the value:0
enter the value:8
among 9,0,8
9 is greatest 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
 
 gcc -g p5original.c
 ./a.out
enter the value
 
 gcc -g p5original.c
 ./a.out
enter the value
3
3
3
large value 3 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
 
 gcc -g p5original.c
 ./a.out
enter the value
4
5
2
large value 5 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x835: file p5original.c, line 28.
(gdb) r
Starting program: /home/runner/test4-Veeranaganjineyareddy-37/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p5original.c:28
28  {
(gdb) n
30    input(&a,&b,&c);
(gdb) n
enter the value
n
31    cmp(a,b,c,&large);
(gdb) n
32    output(a,b,c,large);
(gdb) n
33    return 0;
(gdb) s
34  }(gdb) p
The history is empty.
(gdb) c
Continuing.
large value 379586144[Inferior 1 (process 369) exited normally]
(gdb) l
29    int a,b,c,large;
30    input(&a,&b,&c);
31    cmp(a,b,c,&large);
32    output(a,b,c,large);
33    return 0;
34  }(gdb) 